public class CheckList {

    /*
      Вот вариант набора тест-кейсов для тестирования https://slqa.ru/cases/DeepSeekFlights/:
      01 - Тестирование авторизации
      + Проверить вход с корректными данными (standard_user/stand_pass1), проверить отображение данных пользователя после входа (ФИО в шапке)
      + Проверить вход с неверным паролем
      + Проверить вход с пустыми полями
      + Проверить вход заблокированного пользователя (locked_out_user)
      + Проверить кнопку выхода (Logout)
      02 - Тестирование формы поиска
      + Проверить поиск с валидными данными
      + Проверить поиск без указания даты
      + Проверить поиск с прошедшей датой
      + Проверить отображение сообщения "Рейсов не найдено" (Курск - Париж, понедельник)
      03 - Тестирование списка рейсов
      + Проверить отображение найденных рейсов
      Проверить сортировку по времени (возрастание/убывание)
      Проверить сортировку по цене (возрастание/убывание)
      + Проверить кнопку "Новый поиск"
      04 - Тестирование формы регистрации
      + Проверить переход к форме регистрации
      + Проверить автозаполнение данных пользователя
      05 Проверить валидацию полей:
      + ФИО (только русские буквы)
      + Паспорт (только цифры и пробелы)
      + Проверить отправку формы с пустыми полями
      + Проверить успешную регистрацию
      + Проверить кнопку "Вернуться к найденным рейсам"
      06 Тестирование UI/UX
      Проверить работу по нажатию Enter в формах
     */

}
